code/src/tsung-conf.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/nix/store/jf5axwnf5lymj96dsgbgz5pqlzbyshs9-tsung-1.6.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug" version="1.0">
  <clients>
    <client host="localhost" cpu="1" use_controller_vm="true" maxusers="960000">
      <ip value="172.31.21.63"></ip>
      <ip value="172.31.23.115"></ip>
      <ip value="172.31.23.114"></ip>
      <ip value="172.31.23.112"></ip>
      <ip value="172.31.23.113"></ip>
      <ip value="172.31.18.80"></ip>
      <ip value="172.31.18.81"></ip>
      <ip value="172.31.18.82"></ip>
      <ip value="172.31.18.83"></ip>
      <ip value="172.31.26.100"></ip>
      <ip value="172.31.26.99"></ip>
      <ip value="172.31.18.106"></ip>
      <ip value="172.31.18.240"></ip>
      <ip value="172.31.30.220"></ip>
      <ip value="172.31.30.188"></ip>
    </client>
  </clients>

  <servers>
    <server host="172.31.22.22" port="8080" type="websocket" />
  </servers>

  <load>
    <arrivalphase phase="1" duration="3600" unit="second">
      <users arrivalrate="1000" unit="second" />
    </arrivalphase>
  </load>

  <options>
    <option name="ports_range" min="1025" max="65535"/>
  </options>

  <sessions>
    <session name="websocket" probability="100" type="ts_websocket">
      <request>
        <websocket type="connect" path="/"></websocket>
      </request>
      <for var="i" from="1" to="1000" incr="1">
        <thinktime value="wait_bidi"></thinktime>
      </for>
    </session>
  </sessions>
</tsung>